parth-20-07/Inventory-Management-System/V3 ESP8266 Reciever Code/src/main.cpp
        // Creating char array where the data in format<box_id><box_communication_address> is saved
        char sd_message[BOX_ID_LENGTH + COMMUNICATION_ID_LENGTH + dt.length()];
        for (int i = 0; i < (BOX_ID_LENGTH + COMMUNICATION_ID_LENGTH + dt.length()); i++)
        {
            if (i < BOX_ID_LENGTH)
                sd_message[i] = box_id[i];
            else if (i < COMMUNICATION_ID_LENGTH)
                sd_message[i] = save_sd_address[i - BOX_ID_LENGTH];
            else
                sd_message[i] = dt[i];
        }

        appendFile(SD, BOX_ID_DETAILS_FILE, sd_message); // Appending the char array in SD Card
        read_box_details_from_sd_card();                 // Updating the box data and saving the new box in Box ID Array
        solid_rgb_ring(GREEN_COLOR);
        update_oled("Added", "New Box", box_id);
        delay(1000);
    }
    else // FALSE
    {
        solid_rgb_ring(RED_COLOR);
        update_oled("Failed", "New Box", box_id);
        delay(1000);
    }

    if (!client.connected()) // Uploading the data in AWS
        checkWiFiThenMQTT();
    else
    {
        client.loop();
        send_Success_Data((String)box_id, "add", connection_status, (String)save_sd_address, "", "");
    }
    return;
}

/**
 * @brief Calibrate the Box
 * Box is calibrated in the following method:
 * 1. NRF is set to the box_address as recieved, and the message "cali,<box_id>" is sent.
 * 2. Checks if recieved message is in the format "cali,ok":
 * 2.1 If message is not in format, AWS is notified.
 * 2.2 If message is in format, AWS is notified, delay of 30 sec is waited.
 * 2.2.1 After the delay of 30 secs, write to radio for the updated calibration data with message "calibration_data_update"
 * 2.2.2 Read the recieved message from NRF for the updated values
 * 2.2.3
 *
 * @param box_id Box ID
 * @param box_address Box Communication Address
 */
void calibrate_box(String box_id, byte *ptr_box_address)
{
    solid_rgb_ring(YELLOW_COLOR);
    update_oled("Calibrating", "Box", box_id);
    delay(1000);

    // Writing the NRF with message "cali,<box_id>"
    String message = "cali," + box_id;
    write_radio(ptr_box_address, message);

    // Check if the message recieved is in required format or not
    set_radio_in_read_mode(ptr_box_address);
    int i = 0;
    String recieved_message = "";
    int max_attempts = 50;
    while (i < max_attempts)
    {
        if (digitalRead(NRF24_IRQ) == LOW)
        {
            recieved_message = read_radio();
            break;
        }
        delay(100);
        i++;
    }

    int connection_status = 0; // 0 -> Failure, 1 -> Success
    // Check if the NRF connection was successful or not
    if (recieved_message = ("cali,ok"))
    {
        connection_status = 1;
        solid_rgb_ring(GREEN_COLOR);
        update_oled("Calibration", "Connect", "Successful");
        delay(1000);
    }
    else
    {
        solid_rgb_ring(RED_COLOR);
        update_oled("Calibration", "Connect", "Failed");
        delay(1000);
    }

    // AWS is contacted and updated if calibration is successful or not
    if (!client.connected())
        checkWiFiThenMQTT();
    else
    {
        client.loop();
        send_Success_Data((String)box_id, "calibrate", connection_status, "", "", "");
    }

    if (connection_status == 1)
    {
        delay(30 * 1000);                                        // Wait for calibration to complete
        write_radio(ptr_box_address, "calibration_data_update"); // Write to radio fpr updated values
        set_radio_in_read_mode(ptr_box_address);
        int i = 0;
        String update_message = "";
        int max_attempts = 50;
        while (i < max_attempts)
        {
            if (digitalRead(NRF24_IRQ) == LOW)
            {
                update_message = read_radio();
                break;
            }
            delay(100);
            i++;
        }

        if (update_message != "") // Check if the radio message is not empty
        {
            solid_rgb_ring(GREEN_COLOR);
            update_oled("Calibration", "Successful", box_id);
            delay(1000);
        }
        else
        {
            connection_status = 0;
            solid_rgb_ring(RED_COLOR);
            update_oled("Calibration", "Failed", box_id);
            delay(1000);
        }

        if (!client.connected())
            checkWiFiThenMQTT();
        else
        {
            client.loop();
            send_Success_Data((String)box_id, "calibration_update", connection_status, update_message, "", "");
        }
    }
    return;
}

/**
 * @brief Contact the Boxes to collect the data from it
 *
 * @param box_id
 * @param box_address
 */
void update_box_data(String box_id, byte *ptr_box_address, String required_params)
{
    char token = '/';
    char params[UPDATE_PARAMETERS];
    int j = 0;
    int recieved_params = sizeof(required_params) / sizeof(required_params[0]);
    for (int i = 0; i < recieved_params; i++)
    {
        if (required_params[i] != token)
            params[j] = required_params[i];
        else
            j++;
    }

    // Write radio with the address recieved
    String write_message = "updt,";
    for (size_t i = 0; i < recieved_params; i++)
        write_message += {(String)params[i] + ','};
    write_radio(ptr_box_address, write_message);

    // Read the radio
    set_radio_in_read_mode(ptr_box_address);
    int i = 0;
    String message = "";
    int max_attempts = 50;
    while (i < max_attempts)
    {
        if (digitalRead(NRF24_IRQ) == LOW)
        {
            message = read_radio();
            break;
        }
        delay(100);
        i++;
    }

    if (message != "")
    {
        // Seperating each recieved parameter values
        char token = ',';
        int j = 0;
        int k = 0;
        char param_values[recieved_params][10];
        for (int i = 0; i < recieved_params; i++)
        {
            if (message[i] != token)
            {
                param_values[j][k] = message[i];
                k++;
            }
            else
            {
                j++;
                k = 0;
            }
        }

        // Joining Parameter values to Parameter Character
        String formatted_params = "";
        for (size_t i = 0; i < recieved_params; i++)
            formatted_params += (String)params[i] + ':' + (String)param_values[i];

        String str_sd_message = hour + ':' + minutes + ':' + seconds + ' ' + box_id + ' ' + formatted_params;
        int msg_size = str_sd_message.length(); // Calculating the message size
        char sd_message[msg_size];              // Str to Char conversion
        for (int i = 0; i < msg_size; i++)
            sd_message[i] = str_sd_message[i];

