parth-20-07/Inventory-Management-System/V3 ESP8266 Reciever Code/src/main.cpp
        // Creating Directory of Format YYYY/MM/
        String str_dir = '/' + (String)year + '/' + (String)month;
        int dir_size = str_dir.length();
        char dir[dir_size]; // Str to Char conversion
        for (int i = 0; i < dir_size; i++)
            dir[i] = str_dir[i];
        createDir(SD, dir);

        // Creating File Path
        String str_file_path = '/' + (String)year + '/' + (String)month + '/' + (String)date + file_extension;
        int path_size = str_file_path.length();
        char file_path[path_size]; // Str to Char conversion
        for (int i = 0; i < path_size; i++)
            file_path[i] = str_file_path[i];
        appendFile(SD, file_path, sd_message);

        if (wifi_connection_status == 1)
        {
            if (!client.connected())
                checkWiFiThenMQTT();
            else
            {
                client.loop();
                sendData(box_id, formatted_params);
            }
        }
        else
            appendFile(SD, AWS_BACKLOG_FILE, sd_message);
    }
}

/**
 * @brief Change Box Settings
 *
 * @param box_id
 * @param box_address
 * @param dt
 * @param st
 * @param bt
 */
void change_box_setting(String box_id, byte *ptr_box_address, String dt, String st, String bt)
{
    solid_rgb_ring(YELLOW_COLOR);
    update_oled("Change", "Setting", box_id);
    delay(1000);
    int success_code = 0;

    String message = "chng," + dt + ',' + st + ',' + bt;
    write_radio(ptr_box_address, message);

    set_radio_in_read_mode(ptr_box_address);
    int i = 0;
    String recieved_message = "";
    int max_attempts = 50;
    while (i < max_attempts)
    {
        if (digitalRead(NRF24_IRQ) == LOW)
        {
            recieved_message = read_radio();
            break;
        }
        delay(100);
        i++;
    }

    if (recieved_message == "chng,ok")
    {
        success_code = 1;
        solid_rgb_ring(GREEN_COLOR);
        update_oled("Setting", "Successful", box_id);
        delay(1000);
    }
    else
    {
        solid_rgb_ring(RED_COLOR);
        update_oled("Setting", "Failed", box_id);
        delay(1000);
    }

    // Update to AWS
    if (!client.connected())
        checkWiFiThenMQTT();
    else
    {
        client.loop();
        send_Success_Data(box_id, "change", success_code, dt, st, bt);
    }
}

/**
 * @brief Buzz the box
 *
 * @param box_id
 * @param box_address
 */
void sound_buzzer(String box_id, byte *ptr_box_address)
{
    solid_rgb_ring(YELLOW_COLOR);
    update_oled("Buzz", "Box", box_id);
    delay(1000);
    String message = "buzz";
    write_radio(ptr_box_address, message);
    solid_rgb_ring(GREEN_COLOR);
    update_oled("Buzz", "Box", "Successful");
    delay(1000);
}

// TODO: NRF24 Functions
/**
 * @brief Write a message to the NRF Radio
 *
 * @param transmission_address 5 byte Transmission Address
 * @param transmission_message 32 byte Transmission Message
 */
void write_radio(byte *ptr_transmission_address, String transmission_message)
{
    update_oled("Sending", "Message", "via NRF");
    radio.openWritingPipe(*ptr_transmission_address);
    radio.setPALevel(RF24_PA_MIN);
    radio.stopListening();
    delay(100);
    radio.write(&transmission_message, sizeof(transmission_message));
    delay(500);
    return;
}

void set_radio_in_read_mode(byte *ptr_recieving_address)
{
    radio.openReadingPipe(0, *ptr_recieving_address);
    radio.setPALevel(RF24_PA_MIN);
    radio.startListening();
    delay(100);
}

String read_radio(void)
{
    update_oled("Recieving", "Message", "via NRF");
    delay(1000);
    String recieved_message = "";
    if (radio.available())
    {
        update_oled("Recieved", "Message", "via NRF");
        radio.read(&recieved_message, sizeof(recieved_message));
    }
    else
        update_oled("Failed", "Message", "via NRF");
    return recieved_message;
}

/**
 * @brief This function is used to fetch the latest data from each boxes on periodic instances.
 * This is activated when the Timer is activated and increases the count variable till its greater than the timer count.
 */
void regular_box_update(int counter)
{
    timerStop(timer);
    timerAlarmDisable(timer);

    solid_rgb_ring(YELLOW_COLOR);
    update_oled("Box", "Polling", "Start");
    delay(1000);
    rtc_get_time();
    connected_boxes = EEPROM.read(CONNECTED_BOXES_STORED_LOCATION);
    for (int i = 0; i < connected_boxes; i++)
    {
        halt_rgb_ring(i);

        String str_delay_time = BOX_DETAILS[i][2];
        char char_delay_time[2];
        for (int i = 0; i < 2; i++)
            char_delay_time[i] = str_delay_time[i];
        int dt = atoi(char_delay_time);
        Serial.println("dt: " + (String)dt);

        if (counter % (dt * 60) == 0)
        {
            String box_id = BOX_DETAILS[i][0];
            String address = BOX_DETAILS[i][1];
            byte box_address[COMMUNICATION_ID_LENGTH];
            for (size_t i = 0; i < COMMUNICATION_ID_LENGTH; i++)
                box_address[i] = address[i];

            update_oled("Contacting", "Box", box_id);
            update_box_data(box_id, box_address, "c");
        }
    }

    solid_rgb_ring(GREEN_COLOR);
    update_oled("Box", "Polling", "Completed");
    delay(1000);
    timerStart(timer);
    timerAlarmEnable(timer);
}

/**
 * @brief Fetch Box Address from the Box ID Array matrix
 *
 * @param box_id 9 byte Box ID
 * @return String 5 byte Box Communication Address
 */
String fetch_box_address(String box_id)
{
    int i;
    for (i = 0; i < connected_boxes; i++)
    {
        String box = BOX_DETAILS[i][0];
        if (box == box_id)
        {
            break;
        }
    }
    String address = BOX_DETAILS[i][1];
    return address;
}

// TODO: Auxillary Functions
/**
 * @brief Reading the SD Card File which stores the "Box ID and communication Address"
 */
void read_box_details_from_sd_card(void)
{
    solid_rgb_ring(YELLOW_COLOR);
    update_oled("Read", "Box Details", "From SD");
    delay(1000);
    RL.readLines(BOX_ID_DETAILS_FILE, &handleEachLine);
    solid_rgb_ring(GREEN_COLOR);
    update_oled("Box Details", "Read", "Done");
    delay(1000);
    return;
}

/**
 * @brief Read File Line by Line
 *
 * @param line The Line to be read and saved
 * @param lineIndex The Index of the Line to be worked on
 */
void handleEachLine(char line[], int lineIndex)
{
    char box_id[BOX_ID_LENGTH];
    char address[COMMUNICATION_ID_LENGTH];
    char dt[2];

    for (int i = 0; i < (BOX_ID_LENGTH + COMMUNICATION_ID_LENGTH + 2); i++)
    {
        if (i < BOX_ID_LENGTH)
        {
            box_id[i] = line[i];
        }
        else if (i < COMMUNICATION_ID_LENGTH)
        {
            address[i - BOX_ID_LENGTH] = line[i];
        }
        else
        {
            dt[i - BOX_ID_LENGTH - COMMUNICATION_ID_LENGTH] = line[i];
        }
    }

