parth-20-07/Inventory-Management-System/V3 ESP8266 Reciever Code/src/main.cpp
unsigned long previousMillis = 0;
const long interval = 5000;

void checkWiFiThenMQTTNonBlocking(void)
{
    connectToWiFi(emptyString);
    if (millis() - previousMillis >= interval && !client.connected())
    {
        previousMillis = millis();
        connectToMqtt(true);
    }
}

void checkWiFiThenReboot(void)
{
    connectToWiFi("Checking WiFi");
    Serial.print("Rebooting");
    ESP.restart();
}

/**
 * @brief Upload data from special protocols to AWS
 *
 * @param box_id
 * @param command
 * @param success_status
 * @param param1
 * @param param2
 */
void send_Success_Data(String box_id, String command, int success_status, String param1, String param2, String param3)
{
    // Reference (String to JSON Converter):https://github.com/bblanchon/ArduinoJson/blob/6.x/examples/JsonGeneratorExample/JsonGeneratorExample.ino
    solid_rgb_ring(YELLOW_COLOR);
    update_oled("AWS", "Upload", "InProgess");
    StaticJsonDocument<50> doc;
    doc["Box ID"] = box_id;
    doc["cmd"] = command;
    doc["success"] = success_status;
    if (command == "add")
        doc["Box Address"] = param1;
    else if (command == "calibration_update")
    {
        if (success_status == 1)
            doc["Calibration Data"] = param1;
    }
    else if (command = "change")
    {
        doc["dt"] = param1;
        doc["st"] = param2;
        doc["bt"] = param3;
    }
    serializeJson(doc, Serial);
    serializeJsonPretty(doc, Serial);
    // The above line prints:
    // {
    //   "Box ID": "123456789",
    //   "cmd": add,
    //   "success": 1,
    //   "param1": "param1_data",
    //   "param2": "param2_data",
    //   "param3": "param3_data",
    // }
    char shadow[measureJson(doc) + 1];
    serializeJson(doc, shadow, sizeof(shadow));
    if (!client.publish(MQTT_PUB_TOPIC, shadow, false, 0))
    {
        lwMQTTErr(client.lastError());
        update_oled("AWS", command, "Failure");
    }
    else
        update_oled("AWS", command, "Success");
}

/**
 * @brief Upload data to AWS for periodic box updates
 *
 * @param box_id
 * @param message
 */
void sendData(String box_id, String message)
{
    // Reference:https://github.com/bblanchon/ArduinoJson/blob/6.x/examples/JsonGeneratorExample/JsonGeneratorExample.ino

    // Seperating the comma seperated values from message in format "<param_letter>:<param_value>"
    char token = ',';
    char formatted_params[UPDATE_PARAMETERS][12];
    int j = 0;
    int k = 0;
    for (int i = 0; i < (sizeof(message) / message[0]); i++)
    {
        if (message[i] != token)
        {
            formatted_params[j][k] = message[i];
            k++;
        }
        else
        {
            j++;
            k = 0;
        }
    }

    // Seperating the colon seperated value and identifier and storing it in different arrays
    char params[j + 1]; // j signifies the number of recieved params
    char param_values[j + 1][10];
    for (size_t i = 0; i < (j + 1); i++)
    {
        params[i] = formatted_params[i][0]; // Saving the param identifier in params matrix
        for (size_t k = 2; k < (sizeof(formatted_params[j]) / sizeof(formatted_params[j][0])); k++)
            param_values[i][k - 2] = formatted_params[i][k];
    }

    // Converting the data into JSON Format
    StaticJsonDocument<50> doc;
    doc["time"] = (char)year + '/' + (char)month + '/' + (char)date + ' ' + (char)hour + ':' + (char)minutes + ':' + (char)seconds;
    doc["Box ID"] = box_id;
    doc["cmd"] = "update";
    for (size_t i = 0; i < (j + 1); i++)
        doc[(String)params[i]] = (String)param_values[i];
    serializeJson(doc, Serial);
    serializeJsonPretty(doc, Serial);
    // The above line prints:
    // {
    //   "Box ID": "123456789",
    //   "cmd": add,
    //   "success": 1,
    //   "param1": "param1_data",
    //   "param2": "param2_data",
    // }
    char shadow[measureJson(doc) + 1];
    serializeJson(doc, shadow, sizeof(shadow));

    if (!client.publish(MQTT_PUB_TOPIC, shadow, false, 0))
    {
        lwMQTTErr(client.lastError());
        update_oled("AWS", "update", "Failure");
    }
    else
        update_oled("AWS", "update", "Success");
}

// TODO: Basic Setup, Code Operation Starts here
void setup()
{
    Serial.begin(115200);
    pin_setup();
    EEPROM.begin(EEPROM_SIZE);
    rgb_ring_setup(110);
    oled_setup();
    nrf24_setup();
    sd_setup();
    wifi_ntp_setup();
    // aws_setup();
    // read_box_details_from_sd_card();
    RL.readLines(ERROR_LOG_FILE, &handleEachErrorLine);
    // if (BOX_DETAILS[0][0] == NULL)
    // {
    //     solid_rgb_ring(RED_COLOR);
    //     update_oled("No", "Box", "Linked");
    //     Serial.println("No Box Linked");
    //     while (BOX_DETAILS[0][0] == NULL)
    //     {
    //     }
    // }
    configure_timer();
    timerAlarmEnable(timer);
    print_company_logo();
    lastMillis = millis();
    set_radio_in_read_mode(BROADCAST_RECIEVER_ADDRESS);
}

// TODO: Loop for the code
void loop()
{

    //? Detects when the rotary encoder button is pressed
    if (digitalRead(outputS) == HIGH)
    {
        timerStop(timer);
        timerAlarmDisable(timer);
        delay(3 * DEBOUNCE_TIME); // Debounce time
        if (digitalRead(outputS) == HIGH)
        {
            delay(500);
            read_rotary_encoder(); // Open Main Menu
            print_company_logo();
        }
        delay(500);
        timerStart(timer);
        timerAlarmEnable(timer);
        set_radio_in_read_mode(BROADCAST_RECIEVER_ADDRESS);
    }

    //? When Count variable overflows the Timer Value, the periodic box polling is done
    if ((count != 0) && ((count % DELAY_ONE_MINUTES) == 0))
    {
        if (previous_count != count)
        {
            Serial.println("Hit at: " + (String)count + " seconds");
            solid_rgb_ring(YELLOW_COLOR);
            //     regular_box_update(count);
            if (count >= DELAY_SIXTY_MINUTES)
                count = 0;
            previous_count = count;
            print_company_logo();
            set_radio_in_read_mode(BROADCAST_RECIEVER_ADDRESS);
        }
    }

    //? Main Splash Screen Cycle
    if ((millis() - lastMillis) > MAIN_SCREEN_REFRESH_TIME)
    {
        lastMillis = millis();
        switch (main_screen_count)
        {
        case 1: // Printing Company Logo
            print_company_logo();
            break;

        case 2: // Shows the currently connected boxes
        {
            connected_boxes = EEPROM.read(CONNECTED_BOXES_STORED_LOCATION);
            update_oled("Connected", "Boxes:", (String)connected_boxes);
        }
        break;

        case 3: // Checks the status of the Wi-Fi Connection
        {
            String wifi_connection_status = "Connected";
            if (WiFi.status() != WL_CONNECTED)
            {
                wifi_connection_status = "Disconn.";
                write_error_log(WIFI_NOT_CONNECTED);
            }
            update_oled("WiFi", ssid, wifi_connection_status);
        }
        break;

        case 4: // Fetches latest time from RTC
        {
            DateTime now = rtc.now();
            year = now.year();
            month = now.month();
            seconds = now.second();
            hour = now.hour();
            minutes = now.minute();
            seconds = now.second();

            String day = (String)year + '/' + (String)month + '/' + (String)date;
            String time = (String)hour + ':' + (String)minutes + ':' + (String)seconds;
            update_oled("Date Time", day, time);
        }
        break;

