parth-20-07/Inventory-Management-System/V3 ESP8266 Reciever Code/src/main.cpp
        case 5: // Checks AWS Connection
        {
            String line2;
            String line3 = "Connected";
            if (client.connected())
                line2 = "Is";
            else
                line2 = "Not";
            update_oled("MQTT", line2, line3);
        }
        break;

        case 6: // Shows the latest Error Log
            update_oled("Latest", "Error", latest_error_log);
            break;

        default: // Set the main screen counter to zero
            main_screen_count = 0;
            break;
        }
        main_screen_count++;
        solid_rgb_ring(BLUE_COLOR);
        set_radio_in_read_mode(BROADCAST_RECIEVER_ADDRESS);
    }

    //? Polls NRF24 to collect live data from boxes
    if (digitalRead(NRF24_IRQ) == LOW)
    {
        Serial.println("Message recieved on NRF");
        String box_id = read_radio();
        if (box_id.length() < BOX_ID_LENGTH)
        {
            String str_box_address = fetch_box_address(box_id);
            byte box_address[COMMUNICATION_ID_LENGTH];
            for (size_t i = 0; i < count; i++)
                box_address[i] = str_box_address[i];
            write_radio(box_address, "send_param_id");
            set_radio_in_read_mode(box_address);
            while (digitalRead(NRF24_IRQ) == HIGH)
                ;
            String recieved_params = read_radio();
            update_box_data(box_id, box_address, recieved_params);
        }
        set_radio_in_read_mode(BROADCAST_RECIEVER_ADDRESS);
    }
}
